제가 작성하는 모든 코드는 girhub를 통해 공유드립니다.  
보통... 4시간 또는 2시간 마다.  
요청시 즉시.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df_s = pd.DataFrame(dict(col1 = [100, 200, 300],
                         col2 = [10, 20, 30],
                         shape = ["A", "B", "C"]))
df_s

   col1  col2 shape
0   100    10     A
1   200    20     B
2   300    30     C

In [3]:
df_s.col1

0    100
1    200
2    300
Name: col1, dtype: int64

In [4]:
df_s.shape

(3, 3)

In [5]:
df_s["shape"]

0    A
1    B
2    C
Name: shape, dtype: object

In [6]:
df_s.iloc[:2, ]

   col1  col2 shape
0   100    10     A
1   200    20     B

In [7]:
df_s.loc[:2, ]

   col1  col2 shape
0   100    10     A
1   200    20     B
2   300    30     C

In [8]:
# df_s.set_index("shape").loc[:2, ] # 에러 발생!!

In [9]:
ser = pd.Series(range(4))
ser.reset_index()

   index  0
0      0  0
1      1  1
2      2  2
3      3  3

In [10]:
df_s.loc[(df_s["col1"] >= 200) & (df_s["shape"] == "C"), ]

   col1  col2 shape
2   300    30     C

In [11]:
df_s.loc[(df_s["shape"] == "B") | (df_s["shape"] == "C"), ]

   col1  col2 shape
1   200    20     B
2   300    30     C

In [12]:
df_s.loc[df_s["shape"].isin(["B", "C"]), ]

   col1  col2 shape
1   200    20     B
2   300    30     C

In [13]:
# ~ 는 True/False 반전
# df_s 객체의 "shape"변수의 원소가 "B" 또는 "C"가 아닌 행을 필터링
df_s.loc[~df_s["shape"].isin(["B", "C"]), ]

   col1  col2 shape
0   100    10     A

In [14]:
df = pd.read_csv("krx_202105_utf8.csv")
df.head(2)

,지수명,종가,대비,등락률,시가,고가,저가,거래량,거래대금,상장시가총액,날짜
0,KRX 300,1901.05,-11.63,-0.61,1913.15,1929.94,1896.65,279548840,13488481375036,2028800954161500,20210503
1,KTOP 30,11520.28,-86.30,-0.74,11609.44,11702.14,11490.84,50048566,5645660149606,1208343758559140,20210503

In [15]:
df_sub = df.loc[df["지수명"] == "KRX 300", ]
df_sub.head(2)

,지수명,종가,대비,등락률,시가,고가,저가,거래량,거래대금,상장시가총액,날짜
0,KRX 300,1901.05,-11.63,-0.61,1913.15,1929.94,1896.65,279548840,13488481375036,2028800954161500,20210503
29,KRX 300,1916.40,15.35,0.81,1903.57,1916.40,1892.36,244040965,11708937073166,2043945386926060,20210504

In [16]:
df["지수명"].unique()

array(['KRX 300', 'KTOP 30', 'KRX 100', 'KRX Mid 200', 'KRX 자동차',
       'KRX 반도체', 'KRX 헬스케어', 'KRX 은행', 'KRX 에너지화학', 'KRX 철강', 'KRX 방송통신',
       'KRX 건설', 'KRX 증권', 'KRX 기계장비', 'KRX 보험', 'KRX 운송', 'KRX 경기소비재',
       'KRX 필수소비재', 'KRX 미디어&엔터테인먼트', 'KRX 정보기술', 'KRX 유틸리티',
       'KRX 300 정보기술', 'KRX 300 금융', 'KRX 300 자유소비재', 'KRX 300 산업재',
       'KRX 300 헬스케어', 'KRX 300 커뮤니케이션서비스', 'KRX 300 소재', 'KRX 300 필수소비재'],
      dtype=object)

In [17]:
df.loc[df["종가"] == df["종가"].max(), ["지수명", "종가", "날짜"]]

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

In [18]:
# .idxmax() 는 최대값의 인덱스를 반환
# 단, 최대값이 2개 이상 존재하는 경우 앞에 위치한 최대값의 인덱스 하나만 반환
df.loc[df["종가"].idxmax(), ["지수명", "종가", "날짜"]]

지수명     KTOP 30
종가     11869.29
날짜     20210510
Name: 117, dtype: object

In [19]:
df.loc[[df["종가"].idxmax()], ["지수명", "종가", "날짜"]]

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

In [20]:
df.loc[df["종가"] == df["종가"].min(), ["지수명", "종가", "날짜"]]

          지수명      종가        날짜
361  KRX 기계장비  591.32  20210521

#### Q. (기출 예제) 결측치가 있는 경우 해당 결측치의 앞과 뒤의 숫자 하나를 사용하여 평균을 산출하고 해당 값으로 결측치를 대치하시오.

In [21]:
ser_na = pd.Series([2, 4, np.nan, 8, 9])
ser_na

0    2.0
1    4.0
2    NaN
3    8.0
4    9.0
dtype: float64

In [22]:
ser_na.interpolate()

0    2.0
1    4.0
2    6.0
3    8.0
4    9.0
dtype: float64

In [23]:
df_na = pd.DataFrame(dict(col1 = [100, 200, 300], 
                          value = [5, np.nan, 20]))
df_na["value_fill"] = df_na["value"].interpolate()
df_na

   col1  value  value_fill
0   100    5.0         5.0
1   200    NaN        12.5
2   300   20.0        20.0

#### Q. 앞/뒤 값의 평균 말고 다른 연산결과를 사용하여 결측 대치를 하고자 하는 경우

In [29]:
df_na["value_s1"] = df_na["value"].shift(1)
df_na["value_sn"] = df_na["value"].shift(-1)
df_na

   col1  value  value_fill  value_s1  value_sn
0   100    5.0         5.0       NaN       NaN
1   200    NaN        12.5       5.0      20.0
2   300   20.0        20.0       NaN       NaN

In [30]:
df_na["value_fill_2"] = np.where(df_na["value"].isna(), 
                                 df_na["value_s1"] + df_na["value_sn"],
                                 df_na["value"])
df_na

   col1  value  value_fill  value_s1  value_sn  value_fill_2
0   100    5.0         5.0       NaN       NaN           5.0
1   200    NaN        12.5       5.0      20.0          25.0
2   300   20.0        20.0       NaN       NaN          20.0

In [24]:
df = pd.read_csv("iris_missing.csv")
df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [25]:
df_sub = df.head()
df_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  5 non-null      float64
 1   Sepal.Width   4 non-null      float64
 2   Petal.Length  4 non-null      float64
 3   Petal.Width   5 non-null      float64
 4   Species       5 non-null      object
dtypes: float64(4), object(1)
memory usage: 328.0+ bytes

In [26]:
df_sub.count()

Sepal.Length    5
Sepal.Width     4
Petal.Length    4
Petal.Width     5
Species         5
dtype: int64

In [27]:
df_sub.isna().sum()

Sepal.Length    0
Sepal.Width     1
Petal.Length    1
Petal.Width     0
Species         0
dtype: int64

In [32]:
df_sub["Sepal.Width"] = df_sub["Sepal.Width"].fillna(-1)
df_sub["Petal.Length"] = df_sub["Petal.Length"].fillna(df_sub["Petal.Length"].mean())
# 경고메세지!!! 
# 이 경우는 무시해도 됨. 인덱스, copy, assign() 함수를 사용하지 않는 경우 발생
# .reset_index() 또는 .copy() 메서드를 미리 사용하는 경우 발생하지 않음.

C:\Users\Encaion\AppData\Local\Temp\ipykernel_3648\4156665726.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sub["Sepal.Width"] = df_sub["Sepal.Width"].fillna(-1)
C:\Users\Encaion\AppData\Local\Temp\ipykernel_3648\4156665726.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sub["Petal.Length"] = df_sub["Petal.Length"].fillna(df_sub["Petal.Length"].mean())

In [33]:
df_sub

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1         -1.0           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [35]:
df_sub2 = df.head().reset_index()
df_sub2["Sepal.Width"] = df_sub2["Sepal.Width"].fillna(-3)

In [38]:
df.isna().sum()

Sepal.Length     7
Sepal.Width     13
Petal.Length    14
Petal.Width      6
Species          0
dtype: int64

In [37]:
df_notna = df.dropna()
df_notna.isna().sum()

Sepal.Length    0
Sepal.Width     0
Petal.Length    0
Petal.Width     0
Species         0
dtype: int64

In [39]:
df_notna2 = df.loc[df["Sepal.Length"].notna(), ]
df_notna2.isna().sum()

Sepal.Length     0
Sepal.Width     10
Petal.Length    10
Petal.Width      3
Species          0
dtype: int64

In [43]:
df.set_index("Species").reset_index().head(2)

  Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0  setosa           5.1          NaN           NaN          0.2
1  setosa           4.9          3.0           1.4          0.2

In [44]:
df.iloc[:2, [4, 0, 1, 2, 3]]

  Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0  setosa           5.1          NaN           NaN          0.2
1  setosa           4.9          3.0           1.4          0.2

In [46]:
df.iloc[:2, np.r_[4, 0:4]]

  Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0  setosa           5.1          NaN           NaN          0.2
1  setosa           4.9          3.0           1.4          0.2

In [48]:
df = pd.read_csv("bike.csv")
df.head(1)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16

In [50]:
df["season"].unique()

array([1, 2, 3, 4], dtype=int64)

In [51]:
df["season"].nunique() # number of unique values(elements)

4

In [52]:
df["season"].value_counts()

4    2734
2    2733
3    2733
1    2686
Name: season, dtype: int64

In [53]:
df["season"].value_counts(normalize = True)

4    0.251148
2    0.251056
3    0.251056
1    0.246739
Name: season, dtype: float64

In [54]:
pd.crosstab(df["season"], df["holiday"])

holiday     0   1
season
1        2615  71
2        2685  48
3        2637  96
4        2638  96

In [55]:
df_sub = df.loc[(df["season"] == 1) & (df["holiday"] == 1), ]
len(df_sub)

71

In [56]:
sum((df["season"] == 1) & (df["holiday"] == 1))

71

In [57]:
pd.crosstab(df["season"], df["holiday"], normalize = "index")

holiday         0         1
season
1        0.973567  0.026433
2        0.982437  0.017563
3        0.964874  0.035126
4        0.964887  0.035113

In [58]:
pd.crosstab(df["season"], df["holiday"],
            values = df["count"], aggfunc = "mean")

holiday           0           1
season
1        117.494837   73.929577
2        215.562756  197.833333
3        234.293136  237.822917
4        198.560273  210.750000

https://datadoctorblog.com/2023/05/06/Py-Basic-Pandas-Crosstab/

In [59]:
df.groupby(["season", "holiday"])["count"].mean()

season  holiday
1       0          117.494837
        1           73.929577
2       0          215.562756
        1          197.833333
3       0          234.293136
        1          237.822917
4       0          198.560273
        1          210.750000
Name: count, dtype: float64

https://datadoctorblog.com/2023/04/28/Py-Basic-Pandas-Groupby/

In [60]:
df_dia = pd.read_csv("diamonds.csv")
df_dia.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [62]:
df_dia.groupby("cut")["price"].agg(["min", "max"])

           min    max
cut
Fair       337  18574
Good       327  18788
Ideal      326  18806
Premium    326  18823
Very Good  336  18818

In [61]:
df_dia.groupby("cut")[["price", "carat"]].agg({"price": "mean",
                                               "carat": "max"})

                 price  carat
cut
Fair       4358.757764   5.01
Good       3928.864452   3.01
Ideal      3457.541970   3.50
Premium    4584.257704   4.01
Very Good  3981.759891   4.00

https://datadoctorblog.com/2023/04/12/Py-Basic-Pandas-New-Columns/

In [2]:
df_s = pd.DataFrame(dict(col1 = [100, 200, 300], 
                         tx1 = ["abc", "aaa", "ccc"],
                         tx2 = [123, "123-456", "010-1234-5678"]))
df_s

   col1  tx1            tx2
0   100  abc            123
1   200  aaa        123-456
2   300  ccc  010-1234-5678

In [3]:
df_s["tx1"].replace("a", "@")

0    abc
1    aaa
2    ccc
Name: tx1, dtype: object

In [4]:
df_s["tx1"].replace("aaa", "@")

0    abc
1      @
2    ccc
Name: tx1, dtype: object

In [5]:
df_s["tx1"].str.replace("a", "@")

0    @bc
1    @@@
2    ccc
Name: tx1, dtype: object

In [6]:
df_s["tx1"].str.replace("aaa", "@")

0    abc
1      @
2    ccc
Name: tx1, dtype: object

In [7]:
df_s["col1"].replace({100: "A", 300: "C"})

0      A
1    200
2      C
Name: col1, dtype: object

In [8]:
df_s["tx1"].str.contains("a")

0     True
1     True
2    False
Name: tx1, dtype: bool

In [9]:
df_s["tx1"].str.contains("a") + 0

0    1
1    1
2    0
Name: tx1, dtype: int32

In [10]:
df_s["tx1"].str.contains("a").sum()

2

In [11]:
df_s.loc[df_s["tx1"].str.contains("a"), ]

   col1  tx1      tx2
0   100  abc      123
1   200  aaa  123-456

In [12]:
df_s.loc[~df_s["tx1"].str.contains("a"), ]

   col1  tx1            tx2
2   300  ccc  010-1234-5678

In [13]:
# ~ 로 반전하는 방법을 모를 경우 다음과 같이 복잡한 정규표현식을 써야함.
df_s.loc[df_s["tx1"].str.contains("^[^a]*?$"), ]

   col1  tx1            tx2
2   300  ccc  010-1234-5678

In [14]:
df_s["tx2"].str.split("-")

0                  NaN
1           [123, 456]
2    [010, 1234, 5678]
Name: tx2, dtype: object

In [15]:
df_s["tx2"].astype("str").str.split("-")

0                [123]
1           [123, 456]
2    [010, 1234, 5678]
Name: tx2, dtype: object

In [16]:
df_s["tx2"].astype("str").str.split("-").explode()

0     123
1     123
1     456
2     010
2    1234
2    5678
Name: tx2, dtype: object

In [17]:
df_s["tx2"].astype("str").str.split("-", expand = True)

     0     1     2
0  123  None  None
1  123   456  None
2  010  1234  5678

In [18]:
df_s["tx2"].astype("str").str.split("-", expand = True).fillna("")

     0     1     2
0  123
1  123   456
2  010  1234  5678

In [19]:
# .add_prefix() 메서드는 Pandas 2.0.0 부터 사용가능
df_s["tx2"].astype("str").str.split("-", expand = True).add_prefix("tx2_")

  tx2_0 tx2_1 tx2_2
0   123  None  None
1   123   456  None
2   010  1234  5678

In [87]:
len("2023-08-02")

10

In [90]:
df_o = pd.DataFrame(dict(cat = ["good", "very good", "bad"]))
df_o_dum = pd.get_dummies(df_o, columns = ["cat"])
df_o_dum

   cat_bad  cat_good  cat_very good
0        0         1              0
1        0         0              1
2        1         0              0

In [91]:
df_o_dum.columns = df_o_dum.columns.str.replace(" ", "_")
df_o_dum

   cat_bad  cat_good  cat_very_good
0        0         1              0
1        0         0              1
2        1         0              0

https://datadoctorblog.com/2023/08/01/Py-ML-Split-Data-Sets-02/

In [92]:
ser_tx = pd.Series(["A", "B", "C"])
ser_tx + "_K"

0    A_K
1    B_K
2    C_K
dtype: object

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.cat.html

In [98]:
ser_t1 = pd.Series(["2023-08-02", "2023-08-03", "2023-08-04"])
ser_t2 = pd.Series(["2023년 8월 2일", "2023년 8월 3일", "2023년 8월 4일"])
ser_t3 = pd.Series([123456, 234567, 345678])

In [94]:
pd.to_datetime(ser_t1)

0   2023-08-02
1   2023-08-03
2   2023-08-04
dtype: datetime64[ns]

In [96]:
# pd.to_datetime(ser_t2)

https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

In [99]:
pd.to_datetime(ser_t2, format = "%Y년 %m월 %d일")

0   2023-08-02
1   2023-08-03
2   2023-08-04
dtype: datetime64[ns]

In [100]:
pd.to_datetime(ser_t3)

0   1970-01-01 00:00:00.000123456
1   1970-01-01 00:00:00.000234567
2   1970-01-01 00:00:00.000345678
dtype: datetime64[ns]

In [101]:
pd.to_datetime(ser_t3, origin = "2023-08-02")

0   2023-08-02 00:00:00.000123456
1   2023-08-02 00:00:00.000234567
2   2023-08-02 00:00:00.000345678
dtype: datetime64[ns]

In [102]:
pd.to_datetime(ser_t3, origin = "2023-08-02", unit = "ms")

0   2023-08-02 00:02:03.456
1   2023-08-02 00:03:54.567
2   2023-08-02 00:05:45.678
dtype: datetime64[ns]

In [ ]:
df_b = pd.read_csv("bike.csv")
df_b = df_b.iloc[2:6, [0]]
df_b

In [111]:
df_b["datetime"] = pd.to_datetime(df_b["datetime"])
df_b["date" ] = df_b["datetime"].dt.date
df_b["year" ] = df_b["datetime"].dt.year
df_b["month"] = df_b["datetime"].dt.month
df_b["hour" ] = df_b["datetime"].dt.hour
df_b["wday" ] = df_b["datetime"].dt.weekday
df_b["is_wend"] = (df_b["wday"] >= 5) + 0
df_b["dt_format"] = df_b["datetime"].dt.strftime("%Y-%m") # 기출
df_b["datetime_s"] = df_b["datetime"] + pd.to_timedelta(9, unit = "hour")

In [112]:
df_b

,datetime,date,year,month,hour,wday,is_wend,dt_format,datetime_s
2,2011-01-01 02:00:00,2011-01-01,2011,1,2,5,1,2011-01,2011-01-01 11:00:00
3,2011-01-01 03:00:00,2011-01-01,2011,1,3,5,1,2011-01,2011-01-01 12:00:00
4,2011-01-01 04:00:00,2011-01-01,2011,1,4,5,1,2011-01,2011-01-01 13:00:00
5,2011-01-01 05:00:00,2011-01-01,2011,1,5,5,1,2011-01,2011-01-01 14:00:00

In [113]:
df_e = pd.read_csv("elec_load_2017_7d.csv")
df_e.head(2)

,YEAR,MONTH,DAY,X1HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,...,X15HR,X16HR,X17HR,X18HR,X19HR,X20HR,X21HR,X22HR,X23HR,X24HR
0,2017,1,1,60178,57862,56165,55135,54450,54401,54147,...,49213,49357,50362,53115,55205,55437,55348,55790,58195,59330
1,2017,1,2,57067,55148,53983,53571,54027,55388,57753,...,72228,71945,72641,73387,72294,69989,67893,66504,67435,69275

In [117]:
df_e_melt = df_e.melt(id_vars = ["YEAR", "MONTH", "DAY"])
df_e_melt.head(2)

   YEAR  MONTH  DAY variable  value
0  2017      1    1     X1HR  60178
1  2017      1    2     X1HR  57067

In [118]:
df_e_melt = df_e.melt(id_vars = df_e.columns[:3])
df_e_melt.head(2)

   YEAR  MONTH  DAY variable  value
0  2017      1    1     X1HR  60178
1  2017      1    2     X1HR  57067

In [120]:
df_e_melt = df_e.melt(id_vars = df_e.columns[:3], 
                      var_name = "HOUR", value_name = "LOAD")
df_e_melt.head(2)

   YEAR  MONTH  DAY  HOUR   LOAD
0  2017      1    1  X1HR  60178
1  2017      1    2  X1HR  57067

In [121]:
df_e_melt["HOUR"].unique()

array(['X1HR', 'X2HR', 'X3HR', 'X4HR', 'X5HR', 'X6HR', 'X7HR', 'X8HR',
       'X9HR', 'X10HR', 'X11HR', 'X12HR', 'X13HR', 'X14HR', 'X15HR',
       'X16HR', 'X17HR', 'X18HR', 'X19HR', 'X20HR', 'X21HR', 'X22HR',
       'X23HR', 'X24HR'], dtype=object)

In [126]:
df_e_melt["HOUR_1"] = df_e_melt["HOUR"].str.replace("X", "")
df_e_melt["HOUR_1"] = df_e_melt["HOUR_1"].str.replace("HR", "")
df_e_melt["HOUR_2"] = df_e_melt["HOUR"].str.replace("X|HR", "", regex = True)
df_e_melt["HOUR_3"] = df_e_melt["HOUR"].str.replace("[^0-9]", "", regex = True)
df_e_melt["HOUR_num"] = df_e_melt["HOUR_1"].astype("int")
# 정규표현식(regular expression) 활성화는 "regex" 인자 사용
df_e_melt.head(2)

   YEAR  MONTH  DAY  HOUR   LOAD HOUR_1 HOUR_2 HOUR_3  HOUR_num
0  2017      1    1  X1HR  60178      1      1      1         1
1  2017      1    2  X1HR  57067      1      1      1         1

In [128]:
df_e_pivot = df_e_melt.pivot(index = ["YEAR", "MONTH", "DAY"], 
                             columns = "HOUR", 
                             values = "LOAD").reset_index()
df_e_pivot.head(2)

HOUR,YEAR,MONTH,DAY,X10HR,X11HR,X12HR,X13HR,X14HR,X15HR,X16HR,...,X23HR,X24HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,X8HR,X9HR
0,2017,1,1,49572,50034,50026,49515,49365,49213,49357,...,58195,59330,57862,56165,55135,54450,54401,54147,52467,50469
1,2017,1,2,70869,72867,73115,69165,71429,72228,71945,...,67435,69275,55148,53983,53571,54027,55388,57753,60781,66494

In [21]:
df = pd.read_csv("../01_DX_Class_Data_Set/bike.csv")
df_1 = df.head()
df_2 = df.tail()

In [24]:
df_1.shape

(5, 12)

In [25]:
df_2.shape

(5, 12)

In [26]:
pd.concat([df_1, df_2])

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0000,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0000,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1,1
10881,2012-12-19 19:00:00,4,0,1,1,15.58,19.695,50,26.0027,7,329,336
10882,2012-12-19 20:00:00,4,0,1,1,14.76,17.425,57,15.0013,10,231,241
10883,2012-12-19 21:00:00,4,0,1,1,13.94,15.910,61,15.0013,4,164,168
10884,2012-12-19 22:00:00,4,0,1,1,13.94,17.425,61,6.0032,12,117,129
10885,2012-12-19 23:00:00,4,0,1,1,13.12,16.665,66,8.9981,4,84,88

In [27]:
pd.concat([df_1, df_2], axis = 1)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,...,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1.0,0.0,0.0,1.0,9.84,14.395,81.0,0.0,3.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2011-01-01 01:00:00,1.0,0.0,0.0,1.0,9.02,13.635,80.0,0.0,8.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2011-01-01 02:00:00,1.0,0.0,0.0,1.0,9.02,13.635,80.0,0.0,5.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2011-01-01 03:00:00,1.0,0.0,0.0,1.0,9.84,14.395,75.0,0.0,3.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2011-01-01 04:00:00,1.0,0.0,0.0,1.0,9.84,14.395,75.0,0.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10881,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,15.58,19.695,50.0,26.0027,7.0,329.0,336.0
10882,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,14.76,17.425,57.0,15.0013,10.0,231.0,241.0
10883,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,13.94,15.910,61.0,15.0013,4.0,164.0,168.0
10884,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,13.94,17.425,61.0,6.0032,12.0,117.0,129.0
10885,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,13.12,16.665,66.0,8.9981,4.0,84.0,88.0

In [134]:
pd.concat([df_1, df_2.reset_index()], axis = 1)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,...,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,...,0,1,1,15.58,19.695,50,26.0027,7,329,336
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,...,0,1,1,14.76,17.425,57,15.0013,10,231,241
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,...,0,1,1,13.94,15.910,61,15.0013,4,164,168
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,...,0,1,1,13.94,17.425,61,6.0032,12,117,129
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,...,0,1,1,13.12,16.665,66,8.9981,4,84,88

https://datadoctorblog.com/2023/05/22/Py-Basic-Pandas-Merge/#concat

In [28]:
df["datetime"] = pd.to_datetime(df["datetime"])
df["date"] = df["datetime"].dt.date
df_d1 = df.groupby("date")["temp"].max().reset_index()
df_d2 = df.groupby("date")["casual"].mean().reset_index()

In [29]:
df_d1.head(1)

         date   temp
0  2011-01-01  18.86

In [30]:
df_d2.head(1)

         date     casual
0  2011-01-01  13.791667

In [31]:
df_d_join = df_d1.merge(df_d2, on = "date", how = "inner")
df_d_join = df_d1.merge(df_d2, left_on = "date", right_on = "date", how = "inner")
df_d_join.head(3)

         date   temp     casual
0  2011-01-01  18.86  13.791667
1  2011-01-02  18.86   5.695652
2  2011-01-03  10.66   5.454545

In [32]:
df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,date
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,2011-01-01
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,2011-01-01

In [33]:
pd.crosstab(index = df["season"], 
            columns = df["weather"], 
            values = df["casual"], 
            aggfunc = lambda x: round(x.mean(), 2) + 3000)

weather        1        2        3       4
season
1        3017.65  3013.72  3003.53  3006.0
2        3053.13  3041.49  3020.59     NaN
3        3054.97  3049.78  3032.92     NaN
4        3033.53  3022.29  3013.67     NaN

In [34]:
pd.crosstab(index = df["season"], 
            columns = df["weather"], 
            values = df["casual"], 
            aggfunc = lambda x: round(x.mean(), 2) + 3000).fillna(-1)

weather        1        2        3       4
season
1        3017.65  3013.72  3003.53  3006.0
2        3053.13  3041.49  3020.59    -1.0
3        3054.97  3049.78  3032.92    -1.0
4        3033.53  3022.29  3013.67    -1.0

In [35]:
x = df.loc[(df["season"] == 1) & (df["weather"] == 1), "casual"]
x.head()

0    3
1    8
2    5
3    3
4    0
Name: casual, dtype: int64

In [36]:
ser = pd.Series(["123", "2", "lot_123", "2_a_5_b"])
ser

0        123
1          2
2    lot_123
3    2_a_5_b
dtype: object

In [37]:
ser[ser.str.contains("[0-9]{2,}")]

0        123
2    lot_123
dtype: object

In [38]:
ser_m = pd.Series(["123원", "1,234$", "34.56$", "-234"])
ser_m

0      123원
1    1,234$
2    34.56$
3      -234
dtype: object

In [39]:
ser_m.str.replace("원|$|,", repl = "", regex = True)

0       123
1     1234$
2    34.56$
3      -234
dtype: object

In [40]:
ser_m.str.replace("원|\$|,", repl = "", regex = True)

0      123
1     1234
2    34.56
3     -234
dtype: object

In [41]:
ser_m.str.replace("[^0-9]", repl = "", regex = True)

0     123
1    1234
2    3456
3     234
dtype: object

In [42]:
ser_m.str.replace("[^0-9.]", repl = "", regex = True)

0      123
1     1234
2    34.56
3      234
dtype: object

In [43]:
ser_m.str.replace("[^0-9.-]", repl = "", regex = True)

0      123
1     1234
2    34.56
3     -234
dtype: object